tap "aws/tap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# GitHub command-line tool
brew "gh"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Agent-centric IDE with spec-driven development
cask "kiro"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Cloud storage client
cask "onedrive"
# VPN client focusing on security
cask "protonvpn"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native desktop client for WhatsApp
cask "whatsapp"
