tap "brew-gem/gems"
tap "localstack/tap"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# GitHub command-line tool
brew "gh"
# Open-source GitLab command-line tool
brew "glab"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Cost estimates for Terraform
brew "infracost"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Project documentation with Markdown
brew "mkdocs"
# Run LLMs with MLX
brew "mlx-lm"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Convert bitmaps to vector graphics
brew "potrace"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# QR Code generation
brew "qrencode"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
brew "brew-gem/gems/gem-cfn-nag"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# Remote desktop application
cask "jump-desktop"
# Agent-centric IDE with spec-driven development
cask "kiro"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# Instant messaging application focusing on security
cask "signal"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
