tap "aws/tap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# Official Amazon AWS command-line interface
brew "awscli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Agent-centric IDE with spec-driven development
cask "kiro"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Discover, download, and run local LLMs
cask "lm-studio"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Cloud storage client
cask "onedrive"
# VPN client focusing on security
cask "protonvpn"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network monitoring and troubleshooting tool
cask "wifiman"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
